[
  {
    "title": "▷ [Only 24h Left] Proprietary Structural Analysis Engineer (Associate, Experienced, Senior)",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Defense, Space & Security (BDS) is hiring Associate, Experienced, andSenior Structural Analysis Engineers for advanced aircraft development programs located in Berkeley, MO. BDS Proprietary programs, develop complex, highl…",
    "redirect_url": "https://www.adzuna.com/land/ad/5421262841?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=98806A59B4E5414A6A4E46051A6A8852AD1D4633"
  },
  {
    "title": "Phantom Works Proprietary Structural Analysis Engineer (Associate, Experienced, Senior)",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. The Phantom Works division of Boeing Defense, Space & Security (BDS) has an exciting opportunity for Associate, Experienced, and Senior Structural Analysis Engineers for advanced aircraft & weapons development programs and techno…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917748?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=4DF814E40A5BB348E5A69EA1C9244A47BC4B9AA2"
  },
  {
    "title": "NETWORK SYSTEM ENGINEER with Security Clearance",
    "company": "CEdge Software Consultants",
    "location": "Saint Louis, Saint Louis County",
    "description": "Skills and Experience: Required: · Bachelor’s degree in Computer Science / Math / Science / Engineering or IT related degree. · 12 years of technical experience is required, to include: o 10 years of demonstrated experience developing networking technologies such as routing, circuit switching, packet switching, multiprotocol label switching (MPLS), and encapsulation protocols, as well as their accompanying international, government, or industry standards. o 4 years of IT planning/scheduling/req…",
    "redirect_url": "https://www.adzuna.com/land/ad/5350689461?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=E9012C4F77AB8C23F9A84474B33D505B5A9A6774"
  },
  {
    "title": "Embedded Engineer - Cyber with Security Clearance",
    "company": "Beacon Hill",
    "location": "Saint Louis, Saint Louis County",
    "description": "Overview We are seeking an Embedded Cyber Software Developer to support cybersecurity initiatives in secure boot, firmware security, and hardware root of trust. The role involves developing and configuring boot loaders, implementing encryption and hashing algorithms, managing secure firmware updates, and collaborating with cross-functional teams to integrate robust security features across the product lifecycle. Key Responsibilities Develop, sign, and configure secure boot loaders (UEFI, EFI, a…",
    "redirect_url": "https://www.adzuna.com/land/ad/5376890321?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=DB730F696EFF9AC2F5F46F609A5AE95AE74D8AD8"
  },
  {
    "title": "Sr. Java Backend Developer(f2f interview)",
    "company": "Axiom Software Solutions Limited",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description Job Description Role: Sr. Java Backend Developer(f2f interview) Location: St. Louis MO - Onsite Position Type: Contract An in-person (face to face) interview will be required at office in St. Louis, MO. Job Description: • Bachelor’s degree in computer science, Information Technology • Minimum of 7 years of experience in developing backend application • Roles And Responsibilities: • Developing high quality, scalable solutions • Working collaboratively with product owners, busines…",
    "redirect_url": "https://www.adzuna.com/land/ad/5422363984?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=2AB566436A01E669F344105563E3AAE10260977F"
  },
  {
    "title": "Electrical Design, Analysis and Test Engineer - (Signing Bonus Potential)",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. The Boeing Company has an exciting opportunity for an Electronic Systems Design, Analysis, and Test Engineer for current and emerging programs across the St. Louis region, including Berkeley, MO, Hazelwood, MO, St. Charles, MO, a…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917628?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=7A9A6D8ABED1EDAFDD18F97BFA04DC752C8EA496"
  },
  {
    "title": "▷ Immediate Start: Senior Structural Design Engineer - F-15",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing St. Louis is building the future creating innovative solutions that will define the next generation of aerospace. We are currently seeking Structural Design Engineers (Levels 4 - 5) to develop, maintain and modify structur…",
    "redirect_url": "https://www.adzuna.com/land/ad/5421711093?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=BAAB041EA3AB246FD625C4A406224E16317F6F28"
  },
  {
    "title": "TSCM Practitioner support (Level III) with Security Clearance",
    "company": "CEdge Software Consultants",
    "location": "Saint Louis, Saint Louis County",
    "description": "Overall Assignment Description: Conduct TSCM, Foreign Visit, Gift Inspection, Digital Counterexploitation, Technical Evaluation activities and other technical operations supporting the NGA TSCM program, TSSC modernization goals, and Office of Counterintelligence Technical CI Division. Maintain familiarization with all governing national and agency level policies, ensuring compliance with all facets of reporting and training requirements as well as all other regulatory guidelines. Duties may inc…",
    "redirect_url": "https://www.adzuna.com/land/ad/5332021304?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=C4EE0B609BB33FCE0A1929A323B5C83E21262A49"
  },
  {
    "title": "Cyber Security Engineer with Security Clearance",
    "company": "CEdge Software Consultants",
    "location": "Saint Louis, Saint Louis County",
    "description": "CEdge has an opportunity for a Cyber Security Engineer (Senior Level), located in St Louis,MO If you are ready to work alongside World Renowned Technology experts, and carry the skills below, this is the opportunity that will inevitably take your career to unbelievable levels! This position requires a TS/SCI Security Clearance Cyber Security Engineer (Senior) Overall Assignment Description: The N2W Cyber Security Engineer will serve as a member of the N2W Active IT and project team, providing s…",
    "redirect_url": "https://www.adzuna.com/land/ad/5332018000?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=C8D2433B299B34886E4570745DF2EC16170B220C"
  },
  {
    "title": "Senior Network Systems Engineer with Security Clearance",
    "company": "Mount Indie, LLC",
    "location": "Saint Louis, Saint Louis County",
    "description": "We are seeking a Network Systems Engineer to join the N2W Active IT and project team, providing critical expertise in systems engineering, network architecture, and project management. This role supports the strategic goals of the N2W IT Program by analyzing, designing, testing, and evaluating LAN/WAN technologies that underpin the delivery of N2W Active IT architecture components. The Network Systems Engineer will assist the Government in defining and refining the overall LAN/WAN design and re…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420645094?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=D22458EACDA54F160D35FABABBF415E38794A006"
  },
  {
    "title": "Senior Structural Analysis Engineer - F-15",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing St. Louis is building the future creating innovative solutions that will define the next generation of aerospace. We are currently seeking Structural Analysis Engineers (Level 4 or 5) to verify structural integrity by usin…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917661?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=B3E1643DF201CF74A3B3EADB5AD175A0A36F11E5"
  },
  {
    "title": "Senior Guidance Navigation and Control Engineer",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Defense, Space & Security (BDS) is hiring Senior Guidance Navigation and Control (GNC) Engineers to join the Flight Systems Engineering Capability in Berkeley, MO. These roles will support new product design, development, …",
    "redirect_url": "https://www.adzuna.com/land/ad/5421262843?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=A4163035608CAE043E5B3E72430E0FF5E31A76F6"
  },
  {
    "title": "▷ [3 Days Left] Experienced or Senior Structural Analysis Engineer",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Defense, Space, and Security (BDS) is seeking motivated and talented Experienced or Senior Structural Analysis Engineer to join our dynamic Engineering Teams in Berkeley, MO. As part of our growing organization, you will b…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917723?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=F4697716EAD63776C37C3A50D8960D848BE65008"
  },
  {
    "title": "Only 24h Left! Lead Aerodynamic Stability & Control Engineer",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. Boeing Defense, Space & Security (BDS) is hiring senior Lead Aerodynamic Stability & Control Engineer to lead and perform Air Data Systems development and analysis for Phantom Works projects in Berkeley, MO. The position covers w…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917727?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=C4B46E5200F17D1BA33724AD38DE938062263695"
  },
  {
    "title": "Network Administrator with Security Clearance",
    "company": "Ascension Federal Services Inc",
    "location": "Saint Louis, Saint Louis County",
    "description": "Network Administrator Location: St. Louis, MO, 63101 Clearance: TS/SCI Job Description: The Network Administrator will be responsible for maintaining and managing the organization's computer network systems. This includes installing, configuring, and maintaining network hardware and software, monitoring network performance, troubleshooting network issues, and ensuring network security. Responsibilities: * Install, configure, and maintain network hardware and software * Monitor network performan…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420630290?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=46C308A42145F5CFDA0938BCD1CA7BCAE49F8639"
  },
  {
    "title": "Field Engineer - Post-Sales Solutions (AI Deployment) with Security Clearance",
    "company": "LaunchCode",
    "location": "Manchester, Saint Louis County",
    "description": "Description LaunchCode is recruiting for a rapidly growing and innovative AI company! This role is with one of our esteemed partners and offers a chance to work at the forefront of AI innovation. If you're excited by cutting-edge technology and thrive on building relationships with customers while helping deploy impactful solutions, this may be the role for you. Position Type: Direct Hire W2, Full-Time, Salary Location: On-site in Washington, D.C. or St. Louis, Missouri, with travel required to…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420637194?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=D38E883D1B04906E8CC135B5812294D6044E8FC6"
  },
  {
    "title": "Logistics Specialist with Security Clearance",
    "company": "Base-2 Solutions, LLC",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description * Help develop guidance, policies, procedures, and programs to deploy successfully workforce and mission from current to new location. * Create, document, and execute a deployment plan to successfully move people and mission from its current location to its new location without mission degradation. * Assist deployment team in communicating deployment process to components and employees. * Determine increment plans (i.e., the order in which organizations will move) along with con…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420645584?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=16C37762B31C74C81A8D950D0AB8BE63487375B2"
  },
  {
    "title": "Senior Electronic Systems Design, Analysis, and Test Engineer - Fighters - (Signing Bonus Potential)",
    "company": "BOEING",
    "location": "Saint Louis, Saint Louis County",
    "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. The Boeing Company has an exciting opportunity for a Senior Electronic Systems Design, Analysis, and Test Engineer for Fighters programs located in Berkeley, MO. These programs include: - F/A-18, EA-18G, F-15, F-22 - production t…",
    "redirect_url": "https://www.adzuna.com/land/ad/5420917611?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=24CA4C8AF9802A5BF9C3F7FECE108296393796E9"
  },
  {
    "title": "Back End Software Engineer (TS Clearance Required) with Security Clearance",
    "company": "North Point Technology, LLC",
    "location": "Saint Louis, Saint Louis County",
    "description": "North Point Technology's FS2 Aero team seeks an experienced Backend Support Software Developer to enhance existing code and integrate solutions for the Aeronautical Navigation Office. The ideal candidate has strong software development expertise and coding skills across diverse tools and projects. You will collaborate with our teams to resolve complex technical issues, support incident response, and drive continual system improvements. Program core hours are 9am-3pm ET. Evening or weekend work …",
    "redirect_url": "https://www.adzuna.com/land/ad/5420650044?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=8CC5933C49B5AE91C66D473B674AEF97A75A0E2E"
  },
  {
    "title": "Operations Manager (TS/SCI) with Security Clearance",
    "company": "Figure Eight Federal LLC",
    "location": "Saint Louis, Saint Louis County",
    "description": "Figure Eight Federal (F8F): Leading the Future of AI Training Data Figure Eight Federal (F8F) provides accurate and reliable human annotated datasets that fuel AI and machine learning for some of the world's biggest brands. With more than 25 years of industry knowledge, F8F's technology powers many of the AI interactions we experience every day. Our solutions and expertise empower our clients to achieve their AI goals and make a significant impact in their industry. We are seeking an exceptiona…",
    "redirect_url": "https://www.adzuna.com/land/ad/5332015223?se=-CGGijqe8BGnPew2NF7tSQ&utm_medium=api&utm_source=0b620397&v=963BA94E9BE027253BE34814D7B88D81C91DDF19"
  }
]